W6D3/art_share/app/controllers/artworks_controller.rb

  def index
    p params
    artist_artworks = Artwork.where(artist: params[:user_id])
    viewer_artworks_share = ArtworkShare.where(viewer: params[:user_id])
    viewer_artworks = viewer_artworks_share.map do |artwork_share|
      Artwork.find(artwork_share.artwork_id)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1 LIMIT $2  [["artist_id", 2], ["LIMIT", 1]]
SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."viewer_id" = $1 LIMIT $2  [["viewer_id", 2], ["LIMIT", 1]]
SELECT "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."viewer_id" = $1  [["viewer_id", 3]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

  def create
    artwork = Artwork.new(artwork_params)
    if artwork.save
---
INSERT INTO "artworks" ("title", "image_url", "artist_id") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Ryan"], ["image_url", "www.netflix.com"], ["artist_id", 7]]

  def show
    artwork = Artwork.find(params[:id])
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

  def update
    artwork = Artwork.find(params[:id])
    if artwork.update(artwork_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "image_url" = $2 WHERE "artworks"."id" = $3  [["title", "appacademy"], ["image_url", "www.appacademy.io"], ["id", 7]]

  def destroy
    artwork = Artwork.find(params[:id])
    artwork.destroy
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 9]]