W6D3/art_share/app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 20]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 4]]
---
  def index
    if params.include?(:user_id)
      render json: Comment.where(user: params[:user_id])
    elsif params.include?(:artwork_id)
      render json: Comment.where(artwork: params[:artwork_id])

INSERT INTO "comments" ("user_id", "artwork_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 2], ["artwork_id", 3], ["body", "Look at me again!"], ["created_at", "2020-01-23 19:40:32.356603"], ["updated_at", "2020-01-23 19:40:32.356603"]]
---
  def create
    comment = Comment.new(comment_params)
    if comment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 8]]
---
  def destroy
    comment = Comment.find(params[:id])
    comment.destroy