W6D3/art_share/app/controllers/likes_controller.rb

  def index
    like1 = Like.where(user: params[:user_id])

    like_map = like1.map do |like|
      if like.like_type == 'Artwork'
        Artwork.find(like.like_id)
      elsif like.like_type == 'Comment'
        Comment.find(like.like_id)
---
SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = $1 ORDER BY "likes"."id" ASC LIMIT $2  [["user_id", 254], ["LIMIT", 1]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 172], ["LIMIT", 1]]
SELECT  "likes".* FROM "likes" WHERE "likes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 202], ["LIMIT", 1]]