W6D3/art_share/app/controllers/users_controller.rb

  def index
    if request.query_string.present?
      user = User.where('username LIKE ?', "%#{params[:username]}%")
      render json: user
    else
      render json: User.all
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Flarnie"], ["LIMIT", 1]]
SELECT "users".* FROM "users"

  def create
    user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "Joe"], ["created_at", "2020-01-23 16:55:40.534082"], ["updated_at", "2020-01-23 16:55:40.534082"]]

  def update
    user = User.find(params[:id])
    if user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "Ryan"], ["updated_at", "2020-01-23 16:56:06.889999"], ["id", 10]]